In [1]:
import pandas as pd

In [5]:
df = pd.read_csv(r"C:\Users\urmis\OneDrive\Desktop\uber_data_Short.csv", low_memory=False)

In [7]:
df.head()

,VendorID,tpep_pickup_datetime,tpep_dropoff_datetime,passenger_count,trip_distance,pickup_longitude,pickup_latitude,RatecodeID,store_and_fwd_flag,dropoff_longitude,dropoff_latitude,payment_type,fare_amount,extra,mta_tax,tip_amount,tolls_amount,improvement_surcharge,total_amount
0,1.0,3/1/2016 0:00,3/1/2016 0:07,1.0,2.50,-73.976746,40.765152,1.0,N,-74.004265,40.746128,1.0,9.0,0.5,0.5,2.05,0.00,0.3,12.35
1,1.0,3/1/2016 0:00,3/1/2016 0:11,1.0,2.90,-73.983482,40.767925,1.0,N,-74.005943,40.733166,1.0,11.0,0.5,0.5,3.05,0.00,0.3,15.35
2,2.0,3/1/2016 0:00,3/1/2016 0:31,2.0,19.98,-73.782021,40.644810,1.0,N,-73.974541,40.675770,1.0,54.5,0.5,0.5,8.00,0.00,0.3,63.80
3,2.0,3/1/2016 0:00,3/1/2016 0:00,3.0,10.78,-73.863419,40.769814,1.0,N,-73.969650,40.757767,1.0,31.5,0.0,0.5,3.78,5.54,0.3,41.62
4,2.0,3/1/2016 0:00,3/1/2016 0:00,5.0,30.43,-73.971741,40.792183,3.0,N,-74.177170,40.695053,1.0,98.0,0.0,0.0,0.00,15.50,0.3,113.80

In [9]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 72813 entries, 0 to 72812
Data columns (total 19 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   VendorID               9999 non-null   float64
 1   tpep_pickup_datetime   9999 non-null   object
 2   tpep_dropoff_datetime  9999 non-null   object
 3   passenger_count        9999 non-null   float64
 4   trip_distance          9999 non-null   float64
 5   pickup_longitude       9999 non-null   float64
 6   pickup_latitude        9999 non-null   float64
 7   RatecodeID             9999 non-null   float64
 8   store_and_fwd_flag     9999 non-null   object
 9   dropoff_longitude      9999 non-null   float64
 10  dropoff_latitude       9999 non-null   float64
 11  payment_type           9999 non-null   float64
 12  fare_amount            9999 non-null   float64
 13  extra                  9999 non-null   float64
 14  mta_tax                9999 non-null   float64
 15  tip_amount             9999 non-null   float64
 16  tolls_amount           9999 non-null   float64
 17  improvement_surcharge  9999 non-null   float64
 18  total_amount           9999 non-null   float64
dtypes: float64(16), object(3)
memory usage: 10.6+ MB

In [11]:
df['tpep_pickup_datetime'] = pd.to_datetime(df['tpep_pickup_datetime'])
df['tpep_dropoff_datetime'] = pd.to_datetime(df['tpep_dropoff_datetime'])

In [13]:
df

,VendorID,tpep_pickup_datetime,tpep_dropoff_datetime,passenger_count,trip_distance,pickup_longitude,pickup_latitude,RatecodeID,store_and_fwd_flag,dropoff_longitude,dropoff_latitude,payment_type,fare_amount,extra,mta_tax,tip_amount,tolls_amount,improvement_surcharge,total_amount
0,1.0,2016-03-01,2016-03-01 00:07:00,1.0,2.50,-73.976746,40.765152,1.0,N,-74.004265,40.746128,1.0,9.0,0.5,0.5,2.05,0.00,0.3,12.35
1,1.0,2016-03-01,2016-03-01 00:11:00,1.0,2.90,-73.983482,40.767925,1.0,N,-74.005943,40.733166,1.0,11.0,0.5,0.5,3.05,0.00,0.3,15.35
2,2.0,2016-03-01,2016-03-01 00:31:00,2.0,19.98,-73.782021,40.644810,1.0,N,-73.974541,40.675770,1.0,54.5,0.5,0.5,8.00,0.00,0.3,63.80
3,2.0,2016-03-01,2016-03-01 00:00:00,3.0,10.78,-73.863419,40.769814,1.0,N,-73.969650,40.757767,1.0,31.5,0.0,0.5,3.78,5.54,0.3,41.62
4,2.0,2016-03-01,2016-03-01 00:00:00,5.0,30.43,-73.971741,40.792183,3.0,N,-74.177170,40.695053,1.0,98.0,0.0,0.0,0.00,15.50,0.3,113.80
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
72808,NaN,NaT,NaT,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
72809,NaN,NaT,NaT,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
72810,NaN,NaT,NaT,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
72811,NaN,NaT,NaT,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
72812,NaN,NaT,NaT,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [15]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 72813 entries, 0 to 72812
Data columns (total 19 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   VendorID               9999 non-null   float64
 1   tpep_pickup_datetime   9999 non-null   datetime64[ns]
 2   tpep_dropoff_datetime  9999 non-null   datetime64[ns]
 3   passenger_count        9999 non-null   float64
 4   trip_distance          9999 non-null   float64
 5   pickup_longitude       9999 non-null   float64
 6   pickup_latitude        9999 non-null   float64
 7   RatecodeID             9999 non-null   float64
 8   store_and_fwd_flag     9999 non-null   object
 9   dropoff_longitude      9999 non-null   float64
 10  dropoff_latitude       9999 non-null   float64
 11  payment_type           9999 non-null   float64
 12  fare_amount            9999 non-null   float64
 13  extra                  9999 non-null   float64
 14  mta_tax                9999 non-null   float64
 15  tip_amount             9999 non-null   float64
 16  tolls_amount           9999 non-null   float64
 17  improvement_surcharge  9999 non-null   float64
 18  total_amount           9999 non-null   float64
dtypes: datetime64[ns](2), float64(16), object(1)
memory usage: 10.6+ MB

In [17]:
datetime_dim = df[['tpep_pickup_datetime', 'tpep_dropoff_datetime']].drop_duplicates().reset_index(drop=True)   #Droped the duplicates
datetime_dim['pickup_hour'] = datetime_dim['tpep_pickup_datetime'].dt.hour
datetime_dim['pickup_day'] = datetime_dim['tpep_pickup_datetime'].dt.day
datetime_dim['pickup_month'] = datetime_dim['tpep_pickup_datetime'].dt.month
datetime_dim['pickup_year'] = datetime_dim['tpep_pickup_datetime'].dt.year
datetime_dim['pickup_weekday'] = datetime_dim['tpep_pickup_datetime'].dt.weekday

datetime_dim['drop_hour'] = datetime_dim['tpep_dropoff_datetime'].dt.hour
datetime_dim['drop_day'] = datetime_dim['tpep_dropoff_datetime'].dt.day
datetime_dim['drop_month'] = datetime_dim['tpep_dropoff_datetime'].dt.month
datetime_dim['drop_year'] = datetime_dim['tpep_dropoff_datetime'].dt.year
datetime_dim['drop_weekday'] = datetime_dim['tpep_dropoff_datetime'].dt.weekday

In [19]:
datetime_dim

,tpep_pickup_datetime,tpep_dropoff_datetime,pickup_hour,pickup_day,pickup_month,pickup_year,pickup_weekday,drop_hour,drop_day,drop_month,drop_year,drop_weekday
0,2016-03-01 00:00:00,2016-03-01 00:07:00,0.0,1.0,3.0,2016.0,1.0,0.0,1.0,3.0,2016.0,1.0
1,2016-03-01 00:00:00,2016-03-01 00:11:00,0.0,1.0,3.0,2016.0,1.0,0.0,1.0,3.0,2016.0,1.0
2,2016-03-01 00:00:00,2016-03-01 00:31:00,0.0,1.0,3.0,2016.0,1.0,0.0,1.0,3.0,2016.0,1.0
3,2016-03-01 00:00:00,2016-03-01 00:00:00,0.0,1.0,3.0,2016.0,1.0,0.0,1.0,3.0,2016.0,1.0
4,2016-03-01 00:00:00,2016-03-01 00:16:00,0.0,1.0,3.0,2016.0,1.0,0.0,1.0,3.0,2016.0,1.0
...,...,...,...,...,...,...,...,...,...,...,...,...
2098,2016-03-10 08:01:00,2016-03-10 08:07:00,8.0,10.0,3.0,2016.0,3.0,8.0,10.0,3.0,2016.0,3.0
2099,2016-03-10 08:01:00,2016-03-10 08:22:00,8.0,10.0,3.0,2016.0,3.0,8.0,10.0,3.0,2016.0,3.0
2100,2016-03-10 08:01:00,2016-03-10 08:27:00,8.0,10.0,3.0,2016.0,3.0,8.0,10.0,3.0,2016.0,3.0
2101,2016-03-10 08:01:00,2016-03-10 08:30:00,8.0,10.0,3.0,2016.0,3.0,8.0,10.0,3.0,2016.0,3.0
2102,NaT,NaT,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [21]:
datetime_dim.index

RangeIndex(start=0, stop=2103, step=1)

In [23]:
datetime_dim['datetime_id'] = datetime_dim.index

In [25]:
datetime_dim

,tpep_pickup_datetime,tpep_dropoff_datetime,pickup_hour,pickup_day,pickup_month,pickup_year,pickup_weekday,drop_hour,drop_day,drop_month,drop_year,drop_weekday,datetime_id
0,2016-03-01 00:00:00,2016-03-01 00:07:00,0.0,1.0,3.0,2016.0,1.0,0.0,1.0,3.0,2016.0,1.0,0
1,2016-03-01 00:00:00,2016-03-01 00:11:00,0.0,1.0,3.0,2016.0,1.0,0.0,1.0,3.0,2016.0,1.0,1
2,2016-03-01 00:00:00,2016-03-01 00:31:00,0.0,1.0,3.0,2016.0,1.0,0.0,1.0,3.0,2016.0,1.0,2
3,2016-03-01 00:00:00,2016-03-01 00:00:00,0.0,1.0,3.0,2016.0,1.0,0.0,1.0,3.0,2016.0,1.0,3
4,2016-03-01 00:00:00,2016-03-01 00:16:00,0.0,1.0,3.0,2016.0,1.0,0.0,1.0,3.0,2016.0,1.0,4
...,...,...,...,...,...,...,...,...,...,...,...,...,...
2098,2016-03-10 08:01:00,2016-03-10 08:07:00,8.0,10.0,3.0,2016.0,3.0,8.0,10.0,3.0,2016.0,3.0,2098
2099,2016-03-10 08:01:00,2016-03-10 08:22:00,8.0,10.0,3.0,2016.0,3.0,8.0,10.0,3.0,2016.0,3.0,2099
2100,2016-03-10 08:01:00,2016-03-10 08:27:00,8.0,10.0,3.0,2016.0,3.0,8.0,10.0,3.0,2016.0,3.0,2100
2101,2016-03-10 08:01:00,2016-03-10 08:30:00,8.0,10.0,3.0,2016.0,3.0,8.0,10.0,3.0,2016.0,3.0,2101
2102,NaT,NaT,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,2102

In [27]:
datetime_dim = datetime_dim[['datetime_id', 'tpep_pickup_datetime', 'pickup_hour', 'pickup_day', 'pickup_month', 'pickup_year', 'pickup_weekday', 'tpep_dropoff_datetime', 'drop_hour','drop_day', 'drop_month', 'drop_year', 'drop_weekday']]

In [29]:
passenger_count_dim = df[['passenger_count']].drop_duplicates().reset_index(drop=True)
passenger_count_dim['passenger_count_id'] = passenger_count_dim.index
passenger_count_dim = passenger_count_dim[['passenger_count_id', 'passenger_count']]

passenger_count_dim.head()

   passenger_count_id  passenger_count
0                   0              1.0
1                   1              2.0
2                   2              3.0
3                   3              5.0
4                   4              6.0

In [31]:
trip_distance_dim = df[['trip_distance']].drop_duplicates().reset_index(drop=True)
trip_distance_dim['trip_distance_id'] = trip_distance_dim.index
trip_distance_dim = trip_distance_dim[['trip_distance_id', 'trip_distance']]
trip_distance_dim.head()

   trip_distance_id  trip_distance
0                 0           2.50
1                 1           2.90
2                 2          19.98
3                 3          10.78
4                 4          30.43

In [33]:
rate_code_type = { 
    1: "standard rate",
    2: "jfk",
    3: "newark",
    4: "nassau or westchester",
    5: "negotiated fare",
    6: "group ride",
}

ratecode_dim = df[['RatecodeID']].drop_duplicates().reset_index(drop=True)
ratecode_dim['rate_code_id'] = ratecode_dim.index
ratecode_dim['ratecode_name'] = ratecode_dim['RatecodeID'].map(rate_code_type)
ratecode_dim = ratecode_dim[['rate_code_id', 'RatecodeID', 'ratecode_name']]

ratecode_dim

   rate_code_id  RatecodeID          ratecode_name
0             0         1.0          standard rate
1             1         3.0                 newark
2             2         2.0                    jfk
3             3         5.0        negotiated fare
4             4         4.0  nassau or westchester
5             5         NaN                    NaN

In [35]:
pickup_location_dim = df[['pickup_longitude', 'pickup_latitude']].drop_duplicates().reset_index(drop=True)
pickup_location_dim['pickup_location_id'] = pickup_location_dim.index
pickup_location_dim = pickup_location_dim[['pickup_location_id', 'pickup_longitude', 'pickup_latitude']]

In [37]:
pickup_location_dim

      pickup_location_id  pickup_longitude  pickup_latitude
0                      0        -73.976746        40.765152
1                      1        -73.983482        40.767925
2                      2        -73.782021        40.644810
3                      3        -73.863419        40.769814
4                      4        -73.971741        40.792183
...                  ...               ...              ...
9888                9888        -73.940002        40.751110
9889                9889        -73.963837        40.756130
9890                9890        -73.954041        40.787571
9891                9891        -73.962227        40.800251
9892                9892               NaN              NaN

[9893 rows x 3 columns]

In [39]:
dropoff_location_dim = df[['dropoff_longitude', 'dropoff_latitude']].drop_duplicates().reset_index(drop=True)
dropoff_location_dim['dropoff_location_id'] = dropoff_location_dim.index
dropoff_location_dim = dropoff_location_dim[['dropoff_location_id', 'dropoff_longitude', 'dropoff_latitude']]

In [41]:
dropoff_location_dim

      dropoff_location_id  dropoff_longitude  dropoff_latitude
0                       0         -74.004265         40.746128
1                       1         -74.005943         40.733166
2                       2         -73.974541         40.675770
3                       3         -73.969650         40.757767
4                       4         -74.177170         40.695053
...                   ...                ...               ...
9901                 9901         -73.864830         40.770409
9902                 9902         -73.954597         40.787472
9903                 9903         -73.872650         40.774433
9904                 9904         -73.974510         40.758911
9905                 9905                NaN               NaN

[9906 rows x 3 columns]

In [43]:
payment_type_name = {
    1: "Credit Card",
    2: "Cash",
    3: "No charge",
    4: "Dispute",
    5: "Unknown",
    6: "voided trip"
}
payment_type_dim = df[['payment_type']].drop_duplicates().reset_index(drop=True)
payment_type_dim['payment_type_id'] = payment_type_dim.index
payment_type_dim['payment_type_name'] = payment_type_dim['payment_type'].map(payment_type_name)
payment_type_dim = payment_type_dim[['payment_type_id', 'payment_type', 'payment_type_name']]

In [45]:
payment_type_dim

   payment_type_id  payment_type payment_type_name
0                0           1.0       Credit Card
1                1           2.0              Cash
2                2           3.0         No charge
3                3           4.0           Dispute
4                4           NaN               NaN

In [47]:
# Find matching rows in both DataFrames where the column passenger_count has the same value, and bring in all the extra columns from 
#passenger_count_dim (like passenger_count_id)

fact_table = df.merge(passenger_count_dim, on='passenger_count') \
    .merge(trip_distance_dim, on='trip_distance') \
    .merge(ratecode_dim, on='RatecodeID') \
    .merge(pickup_location_dim, on=['pickup_longitude', 'pickup_latitude']) \
    .merge(dropoff_location_dim, on=['dropoff_longitude', 'dropoff_latitude']) \
    .merge(datetime_dim, on=['tpep_pickup_datetime', 'tpep_dropoff_datetime']) \
    .merge(payment_type_dim, on='payment_type') \
    [['VendorID', 'datetime_id', 'passenger_count_id', 'trip_distance_id', 
      'pickup_location_id', 'dropoff_location_id', 'RatecodeID', 
      'payment_type_id', 'fare_amount', 'mta_tax', 'tip_amount', 
      'tolls_amount', 'improvement_surcharge', 'total_amount']]

In [49]:
fact_table

,VendorID,datetime_id,passenger_count_id,trip_distance_id,pickup_location_id,dropoff_location_id,RatecodeID,payment_type_id,fare_amount,mta_tax,tip_amount,tolls_amount,improvement_surcharge,total_amount
0,1.0,0,0,0,0,0,1.0,0,9.0,0.5,2.05,0.00,0.3,12.35
1,1.0,1,0,1,1,1,1.0,0,11.0,0.5,3.05,0.00,0.3,15.35
2,2.0,2,1,2,2,2,1.0,0,54.5,0.5,8.00,0.00,0.3,63.80
3,2.0,3,2,3,3,3,1.0,0,31.5,0.5,3.78,5.54,0.3,41.62
4,2.0,3,3,4,4,4,3.0,0,98.0,0.0,0.00,15.50,0.3,113.80
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
72808,NaN,2102,6,1243,9892,9905,NaN,4,NaN,NaN,NaN,NaN,NaN,NaN
72809,NaN,2102,6,1243,9892,9905,NaN,4,NaN,NaN,NaN,NaN,NaN,NaN
72810,NaN,2102,6,1243,9892,9905,NaN,4,NaN,NaN,NaN,NaN,NaN,NaN
72811,NaN,2102,6,1243,9892,9905,NaN,4,NaN,NaN,NaN,NaN,NaN,NaN
72812,NaN,2102,6,1243,9892,9905,NaN,4,NaN,NaN,NaN,NaN,NaN,NaN

In [51]:
df.head()

,VendorID,tpep_pickup_datetime,tpep_dropoff_datetime,passenger_count,trip_distance,pickup_longitude,pickup_latitude,RatecodeID,store_and_fwd_flag,dropoff_longitude,dropoff_latitude,payment_type,fare_amount,extra,mta_tax,tip_amount,tolls_amount,improvement_surcharge,total_amount
0,1.0,2016-03-01,2016-03-01 00:07:00,1.0,2.50,-73.976746,40.765152,1.0,N,-74.004265,40.746128,1.0,9.0,0.5,0.5,2.05,0.00,0.3,12.35
1,1.0,2016-03-01,2016-03-01 00:11:00,1.0,2.90,-73.983482,40.767925,1.0,N,-74.005943,40.733166,1.0,11.0,0.5,0.5,3.05,0.00,0.3,15.35
2,2.0,2016-03-01,2016-03-01 00:31:00,2.0,19.98,-73.782021,40.644810,1.0,N,-73.974541,40.675770,1.0,54.5,0.5,0.5,8.00,0.00,0.3,63.80
3,2.0,2016-03-01,2016-03-01 00:00:00,3.0,10.78,-73.863419,40.769814,1.0,N,-73.969650,40.757767,1.0,31.5,0.0,0.5,3.78,5.54,0.3,41.62
4,2.0,2016-03-01,2016-03-01 00:00:00,5.0,30.43,-73.971741,40.792183,3.0,N,-74.177170,40.695053,1.0,98.0,0.0,0.0,0.00,15.50,0.3,113.80